11/data/attachments/d138e4ee885c61ce.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_83b69bfa-14d6-4319-8bb0-2aa5560a6430</nif:username>
            <nif:friendToBeAdded>Matthew_development_Friend_68074_3</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>